DAMAGE_MAP = {'攻击威力': '自身攻击%', '附加伤害': '', '目标当前生命百分比': '其当前生命%',
              '目标最大生命百分比': '其最大生命%', '自身当前生命百分比': '自身当前生命%',
              '自身最大生命百分比': '自身最大生命%', '附加护甲': '自身护甲%', '目标已损失生命值': '其已损失生命%',
              '百分比伤害上限': '自身攻击%', '附加已损失生命值': '自身已损失生命值%',
              '上一次造成的伤害': '上一次造成伤害的%', '自身护盾百分比': '自身护盾%', '上一次造成的治疗': '%',
              '上一次受到的伤害': '%', '目标负面状态数量关联伤害': '自身攻击%', '状态层数关联伤害': '自身攻击%',
              '目标状态ID': '自身攻击%', '自身状态ID': '自身攻击%', '暴击伤害额外提高': '爆头伤害额外提高%',
              '单位距离伤害修正': ''}

STATE_MAP = {"伤害提升率": "伤害加成%",
             "效果改变值": "%",
             "技能改变值": "%"}

STATE_CN_MAP = {'生命回复': 'life_reply', '攻击': 'atk', '攻击百分比': 'atk_percent', '物理防御': 'p_def', '魔法防御': 'm_def',
                '百分比加物理防御': 'p_def_percent', '百分比加魔法防御': 'm_def_percent', '物理穿甲率': 'arp_percent',
                '魔法穿甲率': 'spp_percent', '最大生命值': 'mhp', '最大生命百分比': 'mhp_percent', '命中率': 'hit_rate',
                '爆头率': 'cri_head_rate', '爆头率减免': 'cri_head_reduce', '爆头伤害': 'cri_head_dmg',
                '爆头伤害减免': 'cri_head_dmg_reduce', '闪避率': 'miss', '效果命中': 'effect_hit', '效果抵抗': 'effect_miss',
                '伤害提升率': 'damage_percent', '伤害减免率': 'damage_reduce_percent', '治疗效果': 'heal_effect',
                '被治疗加成': 'heal_enhance_percent', '攻速加成百分比': 'attack_speed_up', '玩家费用回复速度': 'player_mana_gen',
                '能量回复速度': 'mana_gen', '支援加强': 'assist_enhance', '部署费用': 'use_mana', '回收费用': 'recover_mana',
                '休整时间': 'reput_cd'}
